Revit 2027 API
ContourSetting.RemoveItem Method
 Remove a contour setting item from the current contour setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveItem(
	ContourSettingItem item
)
Public Sub RemoveItem (
	item As ContourSettingItem
)
public:
void RemoveItem(
	ContourSettingItem^ item
)
member RemoveItem :
        item : ContourSettingItem -> unit
Parameters
item ContourSettingItem
 The contour setting item to be removed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Contour setting will not be changed if the item could not be found.
See Also
Reference
ContourSetting Class
Autodesk.Revit.DB Namespace